# Задачи на C++

# 1. Общие буквы

Вам даны слова. Выведите в алфавитном порядке список общих букв всех слов.

## Формат ввода

На вход поступают слова (по одному в строке), состоящие из маленьких латинских букв алфавита. Длина слов не превосходит 100 символов, а количество слов не превосходит 1000.

## Формат вывода

Выведите в алфавитном порядке без пробелов список букв, которые присутствуют в каждом слове.

## Пример 1
### Ввод
```
apple
peach
```
Вывод
```
aep
```

## Пример 2
### Ввод
```
alpha
beta
gamma
```

Вывод
```
a
```

## Пример 3
### Ввод
```
alpha
beta
gamma
delta
epsilon
```

### Вывод
```
```

# 2. Пароли


Пароль от некоторого сервиса должен удовлетворять таким ограничениям:
- состоять из символов таблицы ASCII с кодами от 33 до 126;
- быть не короче 8 символов и не длиннее 14;
- из 4 классов символов — большие буквы, маленькие буквы, цифры, прочие символы — в пароле должны присутствовать не менее трёх любых.

Напишите программу, которая проверит, что введённый пароль подходит под эти ограничения.
## Формат ввода

На входе дана одна строка с паролем.
## Формат вывода

Выведите YES, если пароль удовлетворяет требованиям, и NO в противном случае.
## Пример
### Ввод
```
Vasya123
```
### Вывод
```
YES
```

# 3. Soundex

Известный алгоритм Soundex определяет, похожи ли два английских слова по звучанию. На вход он принимает слово и заменяет его на некоторый четырёхсимвольный код. Если коды двух слов совпадают, то слова, как правило, звучат похоже.

Вам требуется реализовать этот алгоритм. Он работает так:

- Первая буква слова сохраняется.
- В остальной части слова буквы a, e, h, i, o, u, w и y удаляются;

- Оставшиеся буквы заменяются на цифры от 1 до 6, причём похожим по звучанию буквам соответствуют одинаковые цифры:
    - b, f, p, v: 1
    - c, g, j, k, q, s, x, z: 2
    - d, t: 3
    - l: 4
    - m, n: 5
    - r: 6
    - Любая последовательность идущих подряд одинаковых цифр сокращается до одной такой цифры.
    - Итоговая строка обрезается до первых четырёх символов.
    - Если длина строки получилась меньше четырёх символов, в конце добавляются нули.

## Примеры:
```
аmmonium → ammnm → a5555 → a5 → a500.
```

```
implementation → implmnttn → i51455335 → i514535 → i514.
```

## Формат ввода

На вход подаётся одно непустое слово из строчных латинских букв. Длина слова не превосходит 20 символов.
## Формат вывода

Напечатайте четырёхбуквенный код, соответствующий слову.
## Пример 1
### Ввод
```
ammonium
```
### Вывод
```
a500
```
## Пример 2
### Ввод
```
implementation
```
### Вывод
```
i514
```

# 4. Палиндромы

Дана строка из строчных латинских букв и пробелов. Проверьте, является ли она палиндромом без учета пробелов.
## Формат ввода

На вход подается одна строка. В строке могут быть пробелы. Подряд может идти произвольное число пробелов. Длина строки не превосходит 100.
## Формат вывода

Представьте, что из строки удалили все пробелы. Необходимо вывести YES, если полученная строка — палиндром, и NO в противном случае.
## Пример 1
### Ввод
```
hello world
```
### Вывод
```
NO
```
## Пример 2
### Ввод
```
never odd or even
```
### Вывод
```
YES
```

# 5. Сапёр

Вам необходимо построить поле для игры «Сапёр» по его конфигурации — высоте, ширине и координатам расставленных на нем мин.

Вкратце напомним правила построения поля для игры «Сапёр»:
- поле состоит из клеток с минами и пустых клеток;
- клетки с миной обозначаются символом *;
- пустые клетки содержат число от 0 до 8 — количество мин на соседних клетках.

## Формат ввода

В первой строке содержатся три числа:

- число m от 1 до 100 — количество строк на поле;
- число n от 1 до 100 — количество столбцов на поле;
- число k от 0 до m x n — количество мин на поле.

В следующих k строках содержатся пары чисел с координатами мин (номерами строки и столбца). Нумерация ведётся с единицы.
## Формат вывода

Выведите построенное поле, разделяя строки поля символом \n, а столбцы — пробелом.
## Пример
### Ввод
```
3 2 2
1 1
2 2
```
### Вывод
```
* 2
2 *
1 1
```

# 6. TimerGuard

Вася хочет замерять время работы разных частей своей программы. Сейчас он делает это средствами стандартной библиотеки так:
```c++
#include <iostream>
#include <chrono>

#include "some_long_stuff.h"

void SomeFunc() {
    auto start1 = std::chrono::high_resolution_clock::now();
    FirstLongFunction();
    std::chrono::duration<double> diff1 = std::chrono::high_resolution_clock::now() - start1;
    std::cout << "FirstLongFunction elapsed: " << diff1.count() << "\n";

    auto start2 = std::chrono::high_resolution_clock::now();
    SecondLongFunction();
    std::chrono::duration<double> diff2 = std::chrono::high_resolution_clock::now() - start2;
    std::cout << "SecondLongFunction elapsed: " << diff2.count() << "\n";

    auto start3 = std::chrono::high_resolution_clock::now();
    ThirdLongFunction();
    std::chrono::duration<double> diff3 = std::chrono::high_resolution_clock::now() - start3;
    std::cout << "ThirdLongFunction elapsed: " << diff3.count() << "\n";
}

int main() {
    SomeFunc();
    return 0;
}
```
Но ему очень не удобно каждый раз прописывать начало замера и конец. Помогите ему сделать это удобнее.

Напишите обёртку TimerGuard. Это класс, который создается перед началом вычислений и при выходе из своего scope пишет в поток время работы, которое он существовал. С его помощью Вася сможет писать так:
```c++
#include <iostream>
#include <chrono>

#include "some_long_stuff.h"

void SomeFunc() {
    {
        TimerGuard timer("FirstLongFunction elapsed: ", std::cout);
        FirstLongFunction();
    }
    {
        TimerGuard timer("SecondLongFunction elapsed: ", std::cout);
        SecondLongFunction();
    }
    {
        TimerGuard timer("ThirdLongFunction elapsed: ", std::cout);
        ThirdLongFunction();
    }
}

int main() {
    SomeFunc();
    return 0;
}
```
Класс TimerGuard должен содержать следующий конструктор:

`TimerGuard(std::string message = "", std::ostream& out = std::cout);`

`message` — сообщение, печатаемое перед перед временем. `out` — поток, в который нужно печатать сообщение.

Деструктор класса должен печатать сообщение в формате "{message} {time}" (обратите внимание на пробел).
### Примечание

Сдайте в систему только код конструкции TimerGuard без функции main. Подключите необходимые библиотеки.
